{
    "id": 5,
    "name": "Firmware Update",
    "instancetype": "single",
    "mandatory": false,
    "description": "This LWM2M Object enables management of firmware which is to be updated. This Object includes installing firmware package, updating firmware, and performing actions after updating firmware.",
    "resourcedefs": {
      "0": {
        "id": 0,
        "name": "Package",
        "operations": "W",
        "instancetype": "single",
        "mandatory": true,
        "type": "opaque",
        "range": "",
        "units": "",
        "description": "Firmware package"
      },
      "1": {
        "id": 1,
        "name": "Package URI",
        "operations": "W",
        "instancetype": "single",
        "mandatory": true,
        "type": "string",
        "range": "0-255 bytes",
        "units": "",
        "description": "URI from where the device can download the firmware package by an alternative mechanism. As soon the device has received the Package URI it performs the download at the next practical opportunity."
      },
      "2": {
        "id": 2,
        "name": "Update",
        "operations": "E",
        "instancetype": "single",
        "mandatory": true,
        "type": "",
        "range": "",
        "units": "",
        "description": "Updates firmware by using the firmware package stored in Package, or, by using the firmware downloaded from the Package URI.\nThis Resource is only executable when the value of the State Resource is Downloaded."
      },
      "3": {
        "id": 3,
        "name": "State",
        "operations": "R",
        "instancetype": "single",
        "mandatory": true,
        "type": "integer",
        "range": "1-3",
        "units": "",
        "description": "Indicates current state with respect to this firmware update. This value is set by the LWM2M Client.\n1: Idle (before downloading or after updating)\n2: Downloading (The data sequence is on the way)\n3: Downloaded\nIf writing the firmware package to Package Resource is done, or, if the device has downloaded the firmware package from the Package URI the state changes to Downloaded.\nIf writing an empty string to Package Resource is done or writing an empty string to Package URI is done, the state changes to Idle.\nIf performing the Update Resource failed, the state remains at Downloaded.\nIf performing the Update Resource was successful, the state changes from Downloaded to Idle."
      },
      "4": {
        "id": 4,
        "name": "Update Supported Objects",
        "operations": "RW",
        "instancetype": "single",
        "mandatory": false,
        "type": "boolean",
        "range": "",
        "units": "",
        "description": "If this value is true, the LWM2M Client MUST inform the registered LWM2M Servers of Objects and Object Instances parameter by sending an Update or Registration message after the firmware update operation at the next practical opportunity if supported Objects in the LWM2M Client have changed, in order for the LWM2M Servers to promptly manage newly installed Objects.\nIf false, Objects and Object Instances parameter MUST be reported at the next periodic Update message.\nThe default value is false."
      },
      "5": {
        "id": 5,
        "name": "Update Result",
        "operations": "R",
        "instancetype": "single",
        "mandatory": true,
        "type": "integer",
        "range": "0-6",
        "units": "",
        "description": "Contains the result of downloading or updating the firmware\n0: Default value. Once the updating process is initiated, this Resource SHOULD be reset to default value.\n1: Firmware updated successfully,\n2: Not enough storage for the new firmware package.\n3. Out of memory during downloading process.\n4: Connection lost during downloading process.\n5: CRC check failure for new downloaded package.\n6: Unsupported package type.\n7: Invalid URI\nThis Resource MAY be reported by sending Observe operation."
      }
    }
}
